app/controllers/logins_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'MyString' AND `users`.`age` = 20 ORDER BY `users`.`id` ASC LIMIT 1
---
    def create
        user = User.where(name: params[:name], age: params[:age]).first