app/controllers/tasks_controller.rb

    def index
      @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `created_at`, `updated_at`) VALUES ('', '', '2024-12-17 05:32:17.586139', '2024-12-17 05:32:17.586139')

    def update
      respond_to do |format|
        if @task.update(task_params)
---
UPDATE `tasks` SET `tasks`.`title` = 'Newらんてくん', `tasks`.`updated_at` = '2024-12-17 07:09:38.867133' WHERE `tasks`.`id` = 34

    def destroy
      @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 35

    def set_task
      @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1