app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`age` BETWEEN 20 AND 50 ORDER BY age DESC
---
  def index
    @users = User.all
    @index_title = 'ユーザー一覧'
    @users = User.where(age: 20..50).order('age DESC')

INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`, `tel`, `address`) VALUES ('らんてくん', 20, '2024-10-06 10:30:26.175494', '2024-10-06 10:30:26.175494', '', '')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `users`.`updated_at` = '2024-10-04 10:47:49.331462', `users`.`tel` = '090-0000-0000', `users`.`address` = '東京都渋谷区宇田川町' WHERE `users`.`id` = 30
---
  def update
    respond_to do |format|
      if @user.update(user_params)